{
  "es": {
    "flag": "es",
    "code": "ES",

    "mainTitle": "AmCheck - Tu analizador de reseñas de Amazon",
    "analyze": "Solicitar Análisis",
    "stats": "Estadísticas",
    "recent": "Análisis Recientes",
    "section1Title": "Bienvenido a AmCheck",
    "section1Subtitle": "Analiza la veracidad de las reseñas de Amazon",
    "urlPlaceholder": "URL de Amazon US o UK",
    "analyzeButton": "Analizar",
    "footerText1": "AmCheck es una aplicación web que permite a los usuarios analizar la veracidad de las reseñas de Amazon. Para ello, se analizan las reseñas de los productos y se muestra un porcentaje de veracidad.",
    "footerText2": "<strong>IMPORTANTE:</strong> El analisis de las reseñas es realizado por un modelo de Machine Learning, por lo que los resultados pueden no ser 100% precisos. La fiabilidad se estima mediante un modelo que evalúa la probabilidad de que una reseña haya sido generada automáticamente o con fines de manipulación (spam, reseñas falsas, etc.).",
    "footerText3": "El modelo ha sido entrenado con un conjunto de datos de reseñas de Amazon, por lo que puede no ser capaz de detectar todas las reseñas falsas o engañosas. Sin embargo, se ha diseñado para ser lo más preciso posible y proporcionar resultados útiles a los usuarios.",
    "footerText4": "Este proyecto es el resultado del TFG (Trabajo Fin de Grado) del Grado de Ingeniería Informática de la Universidad de Cádiz.",
    "footerText5": "<strong>Pablo Vilar Bustillo. 2025</strong>",

    "speedPlaceholder": "Velocidad sin igual",
    "speedSubtitlePlaceholder": "Análisis rápido gracias a concurrencia y aceleración de GPU para el modelo.",
    "accuracyPlaceholder": "Alta precisión",
    "accuracySubtitlePlaceholder": "Modelo entrenado con más de 25M reseñas. Precisión superior al 80%.",
    "transparencyPlaceholder": "Transparencia de datos",
    "transparencySubtitlePlaceholder": "Solo se almacenan los datos de los últimos análisis realizados.",

    "sectionTitle-service1": "Velocidad sin igual",
    "sectionDescription-service1": "Se realizan análisis rápidos gracias a la concurrencia y a la aceleración de GPU para el modelo. Esto permite que los usuarios obtengan resultados con la mayor rapidez posible, sin tener que esperar largos períodos de tiempo.",
    "sectionList1-service1": "Concurrencia aplicada en la obtención de las reseñas para acelerar el proceso al máximo posible.",
    "sectionList2-service1": "Aceleración de GPU optimizada para el modelo de Machine Learning, aprovechando los recursos al máximo con el fin de obtener resultados rápidos.",
    "sectionList3-service1": "Persistencia de los datos de los últimos análisis realizados, lo que permite a los usuarios acceder a sus resultados de forma rápida y sencilla, sin tener que volver a realizar el análisis.",
    "sectionTitle-service2": "Alta precisión",
    "sectionDescription-service2": "El modelo de Machine Learning ha sido entrenado con más de 25 millones de reseñas, lo que le permite alcanzar una precisión superior al 80%. Esto significa que los usuarios pueden confiar en los resultados obtenidos y utilizarlos como una herramienta adicional para evaluar la veracidad de las reseñas.",
    "sectionList1-service2": "Modelo entrenado con más de 25 millones de reseñas de todo tipo de productos, para garantizar la precisión en cualquier tipo de análisis.",
    "sectionList2-service2": "Resultados obtenidos utilizando NVIDIA CUDA©, para que el proceso sea lo más rápido posible.",
    "sectionList3-service2": "Utilizados un conjunto de datos de reseñas de Amazon, que incluye reseñas reales y falsas, para aprender a identificar patrones en las reseñas y determinar su veracidad ante multitud de productos.",

    "faqTitle": "¿Tienes preguntas? Consulta nuestras preguntas frecuentes",
    "faqDescription": "Si tienes alguna pregunta o duda sobre el funcionamiento de AmCheck, no dudes en consultar nuestras preguntas frecuentes. Aquí encontrarás respuestas a las preguntas más comunes y podrás resolver tus dudas de forma rápida y sencilla.",
    "faqQuestion1": "¿Qué es AmCheck?",
    "faqAnswer1": "AmCheck es una aplicación web que permite a los usuarios analizar la veracidad de las reseñas de Amazon. Para ello, se analizan las reseñas de los productos y se muestra un porcentaje de veracidad.",
    "faqQuestion2": "¿Cómo funciona AmCheck?",
    "faqAnswer2": "AmCheck utiliza un modelo de Machine Learning entrenado con un conjunto de datos de reseñas de Amazon para analizar la veracidad de las reseñas. El modelo analiza las reseñas y muestra un porcentaje de veracidad.",
    "faqQuestion3": "¿Cuánto tiempo se tarda en analizar una reseña?",
    "faqAnswer3": "El tiempo de análisis depende del número de reseñas y de la carga del servidor. Sin embargo, AmCheck está diseñado para ser rápido y eficiente, por lo que el análisis suele completarse de forma rápida.",
    "faqQuestion4": "¿Por qué no puedo analizar reseñas de otros países?",
    "faqAnswer4": "AmCheck está diseñado para analizar reseñas de Amazon US y UK, ya que el modelo necesita de reseñas en Inglés. De momento no está contemplada la posibilidad de analizar reseñas de otros países.",
    "faqQuestion5": "¿Qué datos se almacenan?",
    "faqAnswer5": "AmCheck almacena los datos de los productos, las reseñas y los resultados de los análisis realizados. Las reseñas se almacenan durante 1 mes y los resultados de los análisis se almacenan durante 24h. Se garantiza que no se almacen datos personales de los usuarios.",
    "faqQuestion6": "¿Qué datos se utilizan para entrenar el modelo?",
    "faqAnswer6": "El modelo de AmCheck ha sido entrenado con un conjunto de datos de reseñas de Amazon, que incluye reseñas reales y falsas. El modelo utiliza estos datos para aprender a identificar patrones en las reseñas y determinar su veracidad.",
    "faqQuestion7": "¿Por qué no puedo ver todas las reseñas de Amazon?",
    "faqAnswer7": "Debido a las limitaciones de Amazon, la última política establece que solo se pueden ver las primeras 100 reseñas de un producto. Sin embargo, AmCheck está diseñado para jugar con filtros para extraer el mayor número de reseñas posible, para ofrecer a los usuarios el análisis más amplio y preciso posible. Por otro lado, solo estan disponibles las reseñas locales del país del producto analizado, por lo que, por ejemplo, si se analiza un producto de Amazon UK, solo se verán las reseñas locales de ese país. Esto es para garantizar que las opiniones esten en el mismo idioma para el modelo.",

    "required": "Este campo es obligatorio",
    "domain": "La URL debe ser de Amazon US (amazon.com) o UK (amazon.co.uk)",
    "product": "La URL debe contener /dp/ para ser un producto",
    "invalid": "La URL no es válida, compruebala.",
    "connection_error": "Error de conexión. Por favor, inténtalo de nuevo más tarde.",

    "analysisProgress": "Análisis en progreso",
    "step1Title": "Obteniendo información del producto y reseñas",
    "step1Description": "AmCheck obtiene la información del producto y las reseñas de Amazon. Por favor, espere mientras se recopilan los datos.",
    "step1Description_completed": "Información y Reseñas obtenidas correctamente. Procediendo al análisis.",
    "step2Title": "Analizando las reseñas con el modelo",
    "step2Description": "AmCheck analiza las reseñas utilizando un modelo de Machine Learning. Por favor, espere mientras se realiza el análisis.",
    "step2Description_completed": "Análisis de las reseñas completado. Mostrando resultados.",
    "errorTitle_step1": "Error al analizar la URL",
    "errorDescription_step1": "No se ha podido analizar la URL. Por favor, contacte con el soporte técnico o inténtelo de nuevo más tarde.",
    "errorTitle_step2": "Error al clasificar las reseñas",
    "errorDescription_step2": "No se ha podido clasificar las reseñas. Por favor, contacte con el soporte técnico o inténtelo de nuevo más tarde.",

    "comment": "BLOQUE PAGINA DE ERROR",

    "errorPageTitle": "Error - AmCheck",
    "errorTitle": "Se ha producido un error inesperado",
    "errorResultDescription": "Lo sentimos, se ha producido un error inesperado cargando el resultado del análisis. Por favor, inténtelo de nuevo más tarde.",
    "errorRecentsDescription": "Lo sentimos, se ha producido un error inesperado cargando los productos analizados recientemente. Por favor, inténtelo de nuevo más tarde.",
    "errorStatsDescription": "Lo sentimos, se ha producido un error inesperado cargando las estadísticas de la herramienta. Por favor, inténtelo de nuevo más tarde.",
    "errorIndexDescription": "Lo sentimos, se ha producido un error inesperado cargando la página de inicio. Por favor, inténtelo de nuevo más tarde.",
    "backToHome": "Volver al Inicio",


    "comment2": "BLOQUE ANÁLISIS DE PRODUCTO",

    "analysisPageTitle": "Resultados del análisis - AmCheck",
    "productTitle": "Detalles del producto",
    "noDescription": "No hay descripción disponible",
    "viewAmazon": "Ver en Amazon",
    "analysisTitle": "Resultados del análisis",
    "authenticityDistribution": "Distribución de Autenticidad",
    "authenticityReviewsLabel": "Reseñas en este rango",
    "authenticityDistributionText": "Distribución de autenticidad",
    "bestReviews": "Reseñas más fiables",
    "worstReviews": "Reseñas menos fiables",
    "showMoreText": "Mostrar más",
    "showLessText": "Mostrar menos",
    "author": "Autor: ",
    "showAllReviews": "Ver todas las reseñas",

    "showing": "Mostrando",
    "to": "a",
    "of": "de",
    "reviews": "reseñas",

    "filterBest": "Mejores resultados",
    "filterWorst": "Peores resultados",
    "clearFilter": "Limpiar filtro",

    "comment3": "BLOQUE ANÁLISIS RECIENTES",

    "recentsPageTitle": "Análisis recientes - AmCheck",
    "recentProductsTitle": "Productos analizados recientemente",
    "recentProductsSubtitle": "Productos analizados por los usuarios de AmCheck en las últimas 24 horas.",
    "viewDetails": "Mostrar Análisis",
    "noRecentProducts": "Lo sentimos, no hay productos analizados en las últimas 24 horas.",
    "goBackHome": "Volver al Inicio",

    "comment4": "BLOQUE ESTADÍSTICAS",

    "statsPageTitle": "Estadísticas - AmCheck",
    "statsTitle": "Estadísticas de la herramienta AmCheck",
    "statsSubtitle": "Estadísticas de los últimos 7 días",
    "statsImportantNotice": "Las estadísticas mostradas son aproximadas y pueden no ser 100% precisas. Se han obtenido de los datos almacenados en la base de datos de AmCheck.",

    "dailyReviews": "Reseñas diarias",
    "authentic": "Auténticas",
    "robotized": "Robotizadas",

    "statsDateTitle": "Selecciona una fecha",
    "statsDateSubtitle": "Los datos son actualizados cada 24 horas, a las 00:00 GMT+2.",
    "statsMetricsTitle": "Mostrando estadísticas hasta el día seleccionado",
    "statsProductsTitle": "Productos",
    "statsTotalProducts": "Productos analizados",
    "statsReviewsTitle": "Reseñas",
    "statsTotalReviews": "Reseñas analizadas hasta la fecha",
    "statsUsersTitle": "Usuarios",
    "statsTotalUsers": "Usuarios únicos",
    "statsAuthenticityTitle": "Autenticidad",

    "statsAvgAuthenticity": "Autenticidad media",
    "statsAuthenticityDistribution": "Proporción de reseñas",
    "statsBestCategoryAuthenticProducts": "Mejor categoría de productos",
    "statsWorstCategoryRobotizedProducts": "Peor categoría de productos",
    "statsBestCategoryAuthenticReviews": "Mejor categoría de reseñas",
    "statsWorstCategoryRobotizedReviews": "Peor categoría de reseñas",
    "statsBestDay": "Día con más análisis",
    "statsHourMostAnalysis": "Hora con más análisis"
  },
  "en": {
    "flag": "gb",
    "code": "EN",

    "mainTitle": "AmCheck - Your Amazon review analyzer",
    "analyze": "Request Analysis",
    "stats": "Statistics",
    "recent": "Recent Analysis",
    "section1Title": "Welcome to AmCheck",
    "section1Subtitle": "Analyze the authenticity of Amazon reviews",
    "urlPlaceholder": "Amazon US or UK URL",
    "analyzeButton": "Analyze",
    "footerText1": "AmCheck is a web application that allows users to analyze the authenticity of Amazon reviews. It analyzes product reviews and displays a percentage of authenticity.",
    "footerText2": "<strong>IMPORTANT:</strong> The analysis of the reviews is performed by a Machine Learning model, so the results may not be 100% accurate. The reliability is estimated by a model that evaluates the probability that a review has been generated automatically or for manipulation purposes (spam, fake reviews, etc.).",
    "footerText3": "The model has been trained with a dataset of Amazon reviews, so it may not be able to detect all fake or misleading reviews. However, it has been designed to be as accurate as possible and provide useful results to users.",
    "footerText4": "This project is the result of the TFG (Final Degree Project) of the Degree in Computer Engineering at the University of Cádiz.",
    "footerText5": "<strong>Pablo Vilar Bustillo. 2025</strong>",

    "speedPlaceholder": "Unmatched speed",
    "speedSubtitlePlaceholder": "Fast analysis thanks to concurrency and GPU acceleration for the model.",
    "accuracyPlaceholder": "High accuracy",
    "accuracySubtitlePlaceholder": "Model trained with over 25M reviews. Accuracy over 80%.",
    "transparencyPlaceholder": "Data transparency",
    "transparencySubtitlePlaceholder": "Only data from the last analyses is stored.",

    "sectionTitle-service1": "Unmatched speed",
    "sectionDescription-service1": "Fast analysis thanks to concurrency and GPU acceleration for the model. This allows users to obtain results as quickly as possible, without having to wait long periods of time.",
    "sectionList1-service1": "Concurrency applied in obtaining reviews to speed up the process as much as possible.",
    "sectionList2-service1": "GPU acceleration optimized for the Machine Learning model, making the most of resources to obtain fast results.",
    "sectionList3-service1": "Persistence of the data from the last analyses performed, allowing users to access their results quickly and easily, without having to re-analyze.",
    "sectionTitle-service2": "High accuracy",
    "sectionDescription-service2": "Machine Learning model has been trained with over 25 million reviews, allowing it to achieve an accuracy of over 80%. This means that users can trust the results obtained and use them as an additional tool to evaluate the authenticity of reviews.",
    "sectionList1-service2": "Model trained with over 25 million reviews of all kinds of products, to ensure accuracy in any type of analysis.",
    "sectionList2-service2": "Results obtained using NVIDIA CUDA©, to make the process as fast as possible.",
    "sectionList3-service2": "A dataset of Amazon reviews has been used, which includes real and fake reviews, to learn to identify patterns in the reviews and determine their authenticity across a wide range of products.",

    "faqTitle": "Got questions? Check our FAQ",
    "faqDescription": "If you have any questions or doubts about how AmCheck works, feel free to check our FAQ. Here you will find answers to the most common questions and you can resolve your doubts quickly and easily.",
    "faqQuestion1": "What is AmCheck?",
    "faqAnswer1": "AmCheck is a web application that allows users to analyze the authenticity of Amazon reviews. It analyzes product reviews and displays a percentage of authenticity.",
    "faqQuestion2": "How does AmCheck work?",
    "faqAnswer2": "AmCheck uses a Machine Learning model trained with a dataset of Amazon reviews to analyze the authenticity of the reviews. The model analyzes the reviews and displays a percentage of authenticity.",
    "faqQuestion3": "How long does it take to analyze a review?",
    "faqAnswer3": "The analysis time depends on the number of reviews and the server load. However, AmCheck is designed to be fast and efficient, so the analysis usually completes quickly.",
    "faqQuestion4": "Why can't I analyze reviews from other countries?",
    "faqAnswer4": "AmCheck is designed to analyze reviews from Amazon US and UK, as the model requires reviews in English. Currently, there is no plan to analyze reviews from other countries.",
    "faqQuestion5": "What data is stored?",
    "faqAnswer5": "AmCheck stores product data, reviews, and results of the analyses performed. Reviews are stored for 1 month and analysis results are stored for 24 hours. It is guaranteed that no personal data of users is stored.",
    "faqQuestion6": "What data is used to train the model?",
    "faqAnswer6": "The AmCheck model has been trained with a dataset of Amazon reviews, which includes real and fake reviews. The model uses this data to learn to identify patterns in the reviews and determine their authenticity.",
    "faqQuestion7": "Why I can't see all reviews from Amazon?",
    "faqAnswer7": "Due to Amazon's limitations, the latest policy states that only the first 100 reviews of a product can be viewed. However, AmCheck is designed to play with filters to extract as many reviews as possible, to offer users the widest and most accurate analysis possible. On the other hand, only local reviews from the country of the product are available, so if, for example, a UK Amazon product is analyzed, only local reviews from that country will be shown. This is to ensure that reviews are in the same language for the model.",

    "required": "This field is required",
    "domain": "The URL must be from Amazon US (amazon.com) or UK (amazon.co.uk)",
    "product": "The URL must contain /dp/ to be a product",
    "invalid": "The URL is not valid, please check it.",
    "connection_error": "Connection error. Please try again later.",

    "analysisProgress": "Analysis in progress",
    "step1Title": "Obtaining product information and reviews",
    "step1Description": "AmCheck obtains product information and reviews from Amazon. Please wait while the data is being collected.",
    "step1Description_completed": "Product and Reviews obtained successfully. Proceeding to analysis.",
    "step2Title": "Analyzing reviews with ML Model",
    "step2Description": "AmCheck analyzes the reviews using a Machine Learning model. Please wait while the analysis is performed.",
    "step2Description_completed": "Review analysis completed. Displaying results.",
    "errorTitle_step1": "Error analyzing the URL",
    "errorDescription_step1": "The URL could not be analyzed. Please contact technical support or try again later.",
    "errorTitle_step2": "Error classifying reviews",
    "errorDescription_step2": "The reviews could not be classified. Please contact technical support or try again later.",

    "comment": "ERROR PAGE BLOCK",

    "errorPageTitle": "Error - AmCheck",
    "errorTitle": "An unexpected error has occurred",
    "errorResultDescription": "Sorry, an unexpected error occurred loading the analysis result. Please try again later.",
    "errorRecentsDescription": "Sorry, an unexpected error occurred loading the recently analyzed products. Please try again later.",
    "errorStatsDescription": "Sorry, an unexpected error occurred loading the tool statistics. Please try again later.",
    "errorIndexDescription": "Sorry, an unexpected error occurred loading the home page. Please try again later.",
    "backToHome": "Go Back Home",

    "comment2": "PRODUCT ANALYSIS BLOCK",

    "analysisPageTitle": "Analysis Results - AmCheck",
    "productTitle": "Product Details",
    "noDescription": "No description available",
    "viewAmazon": "View on Amazon",
    "analysisTitle": "Analysis Results",
    "authenticityDistribution": "Authenticity Distribution",
    "authenticityReviewsLabel": "Reviews in this range",
    "authenticityDistributionText": "Authenticity distribution",
    "bestReviews": "Most Reliable Reviews",
    "worstReviews": "Least Reliable Reviews",
    "showMoreText": "Show more",
    "showLessText": "Show less",
    "author": "Author: ",
    "showAllReviews": "Show all reviews",

    "showing": "Showing",
    "to": "to",
    "of": "of",
    "reviews": "reviews",

    "filterBest": "Best results",
    "filterWorst": "Worst results",
    "clearFilter": "Clear filter",

    "comment3": "RECENT ANALYSIS BLOCK",

    "recentsPageTitle": "Recent Analysis - AmCheck",
    "recentProductsTitle": "Recently analyzed products",
    "recentProductsSubtitle": "Products analyzed by AmCheck users in the last 24 hours.",
    "viewDetails": "Show Analysis",
    "noRecentProducts": "Sorry, there are no products analyzed in the last 24 hours.",
    "goBackHome": "Go Back Home",

    "comment4": "STATS BLOCK",

    "statsPageTitle": "Statistics - AmCheck",
    "statsTitle": "AmCheck Tool Statistics",
    "statsSubtitle": "Statistics from the last 7 days",
    "statsImportantNotice": "The statistics shown are approximate and may not be 100% accurate. They have been obtained from the data stored in the AmCheck database.",

    "dailyReviews": "Daily Reviews",
    "authentic": "Authentic",
    "robotized": "Robotized",

    "statsMetricsTitle": "Showing statistics until selected date",
    "statsDateTitle": "Select a date",
    "statsDateSubtitle": "Data is updated every 24 hours, at 00:00 GMT+2.",
    "statsProductsTitle": "Products",
    "statsTotalProducts": "Products analyzed",
    "statsReviewsTitle": "Reviews",
    "statsTotalReviews": "Reviews analyzed to date",
    "statsUsersTitle": "Users",
    "statsTotalUsers": "Unique users",
    "statsAuthenticityTitle": "Authenticity",

    "statsAvgAuthenticity": "Average Authenticity",
    "statsAuthenticityDistribution": "Reviews Proportion",
    "statsBestCategoryAuthenticProducts": "Best product category",
    "statsWorstCategoryRobotizedProducts": "Worst product category",
    "statsBestCategoryAuthenticReviews": "Best review category",
    "statsWorstCategoryRobotizedReviews": "Worst review category",
    "statsBestDay": "Day with most analysis",
    "statsHourMostAnalysis": "Hour with most analysis"
  }
}